# **PANDAS**

- It is a python library used for data manipulation and analysis.
- There are two core objects in pandas.:
    
   **pandas series**
   
    It is a one dimension array that can hold data of any type.
    
   **dataframes** 
   
    It is a two dimensional array with both rows and columns label.

In [1]:
import pandas as pd
import numpy as np

## <u> Pandas Module Breakdown <u>

- *creating,reading and writing data.*


- *indexing,selection and assigning.*


- *summary functions.*


- *grouping and sorting*


- *saving in csv format.*

### **1. CREATING DATA IN PANDAS**

- We create series by passing a list or a dictionary in pd.series.

In [2]:
mylist=[1,2,3,"f","d"]
mylist

[1, 2, 3, 'f', 'd']

In [3]:
my_series=pd.Series(mylist)
my_series

0    1
1    2
2    3
3    f
4    d
dtype: object

In [4]:
my_series.dtype

dtype('O')

In [5]:
my_series.ndim

1

In [6]:
type(my_series)

pandas.core.series.Series

In [7]:
dict={"company":["jkuat","bidco","temco"],
     "wealth(M)":[20,30,50]}
dict

{'company': ['jkuat', 'bidco', 'temco'], 'wealth(M)': [20, 30, 50]}

In [8]:
mydict={"faith":"samsung","class":"python","school":"jkuat"}
print(mydict)
print(type(mydict))

{'faith': 'samsung', 'class': 'python', 'school': 'jkuat'}
<class 'dict'>

In [9]:
series=pd.Series(dict)
series

company      [jkuat, bidco, temco]
wealth(M)             [20, 30, 50]
dtype: object

In [10]:
series.dtype

dtype('O')

In [11]:
type(series)

pandas.core.series.Series

### 2. Data frames

- For us to create a data frame we can pass only a dictionary ie the dict created above

In [12]:
data=pd.DataFrame(dict)
print(data)

  company  wealth(M)
0   jkuat         20
1   bidco         30
2   temco         50

In [13]:
data.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
dict={"tecno":[5,6,7,3],"samsung":[4,8,4,3]}
print(dict)

{'tecno': [5, 6, 7, 3], 'samsung': [4, 8, 4, 3]}

In [15]:
data=pd.DataFrame(dict)
print(data)

   tecno  samsung
0      5        4
1      6        8
2      7        4
3      3        3

In [16]:
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [17]:
data.index

RangeIndex(start=0, stop=4, step=1)

- **Changing the Index from `0,1,2,3` to `"Gate A","Gate B","Gate C","Gate D"`**

In [18]:
phones=pd.DataFrame(dict,index=["Gate A","Gate B","Gate C","Gate D"])
print(phones)

        tecno  samsung
Gate A      5        4
Gate B      6        8
Gate C      7        4
Gate D      3        3

In [19]:
print(phones.index)

Index(['Gate A', 'Gate B', 'Gate C', 'Gate D'], dtype='object')

- Combining everything in one line

In [20]:
mydataframe=pd.DataFrame({"tecno":[5,6,7,3],"samsung":[4,8,4,3]},index=["Gate A","Gate B","Gate C","Gate D"])
print(mydataframe)

        tecno  samsung
Gate A      5        4
Gate B      6        8
Gate C      7        4
Gate D      3        3

In [21]:
mydataframe.index

Index(['Gate A', 'Gate B', 'Gate C', 'Gate D'], dtype='object')

### **3.  Reading and writing data in pandas**

When reading data files in pandas its important to read it with its format.

**Examples of the files formats and how we read them**

excel=pd.read_xlsx("data.xlsx")
HTML=pd.read_html("data.html")
tables=pd.read_table("data.table")
csv=pd.read_csv("name.csv")

NB:It is important to note that a singlebackslash does not work when specifying the file path. You need to either change it to forward slash or add one more backslash like below

#### <b>1. Import CSV files</u>

In [22]:
data4=pd.read_csv("df.csv") 
data4

     County  Population   Area      count
0   Nairobi   4397073.0    704  4397073.0
1    Kisumu   1155574.0   2085  1155574.0
2   Mombasa   1208333.0    220  1208333.0
3   Bungoma   1670570.0   3024  1670570.0
4   Mandera    867457.0  25942   867457.0
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0
9      Embu         NaN   2821        NaN

**If no header (title) in raw data file**

You need to include header = None option to tell Python there is no column name (header) in data.

mydata= pd.read_csv("C:\\Users\\jkuat\\Data\\df2.csv",header=None)

#### <b>2. Import File from URL

mydata = pd.read_csv("http://winterolympicsmedals.com/medals.csv")

You don't need to perform additional steps to fetch data from URL. Simply put URL in read_csv() function (applicable only for CSV files stored in URL)

#### <b>3. Read Text File

We can use read_table() function to pull data from text file. We can also use read_csv() with sep= "\t" to read data from tab-separated file.

mydata = pd.read_table("C:\\Users\\Deepanshu\\Desktop\\example2.txt")
mydata = pd.read_csv("C:\\Users\\Deepanshu\\Desktop\\example2.txt", sep ="\t")

#### <b>4. Read Excel File

The read_excel() function can be used to import excel data into Python.

mydata = pd.read_excel("https://www.eia.gov/dnav/pet/hist_xls/RBRTEd.xls",sheetname="Data 1", skiprows=2)

If you do not specify name of sheet in sheetname= option, it would take by default first sheet.

#### <b>5. Read SAS File

We can import SAS data file by using read_sas() function.

mydata4 = pd.read_sas('cars.sas7bdat')

f you have a large SAS File, you can try package named `pyreadstat` which is faster than pandas. It is equivalent to `haven` package in R which provides easy and fast way to read data from SAS, SPSS and Stata. To install this package, you can use the command `pip install pyreadstat`

#### <b> 6. Read Stata File

We can load Stata data file via read_stata() function.

mydata41 = pd.read_stata('cars.dta')

`pyreadstat` package lets you to pull value labels from stata files.

import pyreadstat
df = pyreadstat.read_dta("cars.dta")

#### <b> 7. Import R Data File

Using pyreadr package, you can load .RData and .Rds format files which in general contains R data frame. You can install this package using the command below -

In [23]:
!pip install pyreadr

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pyreadr in c:\users\joe\appdata\roaming\python\python39\site-packages (0.4.7)
Requirement already satisfied: pandas>=1.2.0 in c:\programdata\anaconda3\lib\site-packages (from pyreadr) (1.4.4)
Requirement already satisfied: numpy>=1.18.5 in c:\programdata\anaconda3\lib\site-packages (from pandas>=1.2.0->pyreadr) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas>=1.2.0->pyreadr) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas>=1.2.0->pyreadr) (2022.1)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas>=1.2.0->pyreadr) (1.16.0)

With the use of `read_r( )` function, we can import R data format files.

import pyreadr
result = pyreadr.read_r('C:/Users/sampledata.RData')

#### <b>8.Import Data from SPSS File

import pyreadstat
df = pyreadstat.read_sav("file.sav", apply_value_formats=True)

If you don't want value labels, make apply_value_formats as False.

#### CSV
We will only focus on csv and excel formats in this level. Let start to read a data file with csv format

In [24]:
data=pd.read_csv("df.csv")
data

     County  Population   Area      count
0   Nairobi   4397073.0    704  4397073.0
1    Kisumu   1155574.0   2085  1155574.0
2   Mombasa   1208333.0    220  1208333.0
3   Bungoma   1670570.0   3024  1670570.0
4   Mandera    867457.0  25942   867457.0
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0
9      Embu         NaN   2821        NaN

In [25]:
mydata7 = pd.read_csv("df.csv", nrows=5, usecols=(1,3))
mydata7

   Population    count
0     4397073  4397073
1     1155574  1155574
2     1208333  1208333
3     1670570  1670570
4      867457   867457

Write a code that will import the variables starts with...."p"
Write a code that will import the variables that ends with...."t"
Write a code that will import the variables that has ...."a"

nrows = 5 implies you want to import only first 5 rows and usecols= refers to specified columns you want to import.

In [26]:
df = pd.read_csv("df.csv", usecols=range(1,4))
df

   Population   Area      count
0   4397073.0    704  4397073.0
1   1155574.0   2085  1155574.0
2   1208333.0    220  1208333.0
3   1670570.0   3024  1670570.0
4    867457.0  25942   867457.0
5    926976.0  68233   926976.0
6    459785.0  70944   459785.0
7    759164.0   3325   759164.0
8   4397073.0    704  4397073.0
9         NaN   2821        NaN

In [27]:
df.index ##Gives the

RangeIndex(start=0, stop=10, step=1)

##### **Skip rows while importing**

Suppose you want to skip first 5 rows and wants to read data from 6th row (6th row would be a header row)

In [28]:
df3=pd.read_csv(("df.csv"),skiprows=5) #When we want to skip rows at the top of the data
df3

    Mandera     867457  25942   867457.1
0   Turkana   926976.0  68233   926976.0
1  Marsabit   459785.0  70944   459785.0
2     Nyeri   759164.0   3325   759164.0
3   Nairobi  4397073.0    704  4397073.0
4      Embu        NaN   2821        NaN

##### **Specify values as missing values**

By including na_values= option, you can specify values as missing values. 
In this case, we are telling python to consider dot (.) as missing cases.

In [29]:
mydata = pd.read_csv("df.csv", na_values=['.'])
mydata["Area"]

0      704
1     2085
2      220
3     3024
4    25942
5    68233
6    70944
7     3325
8      704
9     2821
Name: Area, dtype: int64

##### **Changing a column to be index while importing**

The data has been imported as shown above. We could add the index by specifying the column we want to use. To do this
we use the index_col parameter followed by the column we want. I.e;

index_col = 'column name'

index_col = value

In [30]:
df11=pd.read_csv(("df.csv"),index_col="Area")
df11

         County  Population      count
Area
704     Nairobi   4397073.0  4397073.0
2085     Kisumu   1155574.0  1155574.0
220     Mombasa   1208333.0  1208333.0
3024    Bungoma   1670570.0  1670570.0
25942   Mandera    867457.0   867457.0
68233   Turkana    926976.0   926976.0
70944  Marsabit    459785.0   459785.0
3325      Nyeri    759164.0   759164.0
704     Nairobi   4397073.0  4397073.0
2821       Embu         NaN        NaN

In [31]:
import pandas as pd
df2=pd.read_csv(("df.csv"),index_col=0)
df2

          Population   Area      count
County
Nairobi    4397073.0    704  4397073.0
Kisumu     1155574.0   2085  1155574.0
Mombasa    1208333.0    220  1208333.0
Bungoma    1670570.0   3024  1670570.0
Mandera     867457.0  25942   867457.0
Turkana     926976.0  68233   926976.0
Marsabit    459785.0  70944   459785.0
Nyeri       759164.0   3325   759164.0
Nairobi    4397073.0    704  4397073.0
Embu             NaN   2821        NaN

In [32]:
df2.index

Index(['Nairobi', 'Kisumu', 'Mombasa', 'Bungoma', 'Mandera', 'Turkana',
       'Marsabit', 'Nyeri', 'Nairobi', 'Embu'],
      dtype='object', name='County')

In [33]:
df2.columns

Index(['Population', 'Area', 'count'], dtype='object')

In [34]:
#gives type of data in each column
df2.dtypes

Population    float64
Area            int64
count         float64
dtype: object

In [35]:
#gives number of entries in each column
df2.count

<bound method DataFrame.count of           Population   Area      count
County
Nairobi    4397073.0    704  4397073.0
Kisumu     1155574.0   2085  1155574.0
Mombasa    1208333.0    220  1208333.0
Bungoma    1670570.0   3024  1670570.0
Mandera     867457.0  25942   867457.0
Turkana     926976.0  68233   926976.0
Marsabit    459785.0  70944   459785.0
Nyeri       759164.0   3325   759164.0
Nairobi    4397073.0    704  4397073.0
Embu             NaN   2821        NaN>

### After reading the data ,we will go through some operations to check the data, this will enable us to see how our data looks.

In [36]:
#to get first five observations by default if no value is passed
df=pd.read_csv("df.csv")

In [37]:
df.head(2)

    County  Population  Area      count
0  Nairobi   4397073.0   704  4397073.0
1   Kisumu   1155574.0  2085  1155574.0

Here we are checking the first five rows in our data. Suppose we wished for the first 3, we
simply put 3 as an argument in the function. This checks the first 3. By
default, it checks the first five if no argument is passed

In [38]:
df.head(3) # This checks the first 3. By default, it checks the first five if no argument is passed

    County  Population  Area      count
0  Nairobi   4397073.0   704  4397073.0
1   Kisumu   1155574.0  2085  1155574.0
2  Mombasa   1208333.0   220  1208333.0

In [39]:
#to get the last five rows in the data by default if no value is passed
df.tail()

     County  Population   Area      count
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0
9      Embu         NaN   2821        NaN

This is the vice-versa of the .head() method. Here we are checking the last five rows in our
data. Suppose we wished for the first 2, we simply put 2 as an argument in the function. if no argument is passed

In [40]:
df.tail(2) #This checks the last 2. By default, it checks the last five

    County  Population  Area      count
8  Nairobi   4397073.0   704  4397073.0
9     Embu         NaN  2821        NaN

In [41]:

df.sample()  #checks a random single row in your data if no argument is passed

    County  Population  Area      count
0  Nairobi   4397073.0   704  4397073.0

In [42]:
#we can pass arguments
df.sample(5) # And if suppose we pass in 5 (data.sample(5)) , this checks a sample of 5 rows randomly selected.

     County  Population   Area      count
8   Nairobi   4397073.0    704  4397073.0
5   Turkana    926976.0  68233   926976.0
7     Nyeri    759164.0   3325   759164.0
9      Embu         NaN   2821        NaN
6  Marsabit    459785.0  70944   459785.0

In [43]:
#to get data dimensions 
df.shape

(10, 4)

### We have two types of data

1. **Categorical or qualitative**
                   a)nominal(no order e.g gender)
                   b) ordinal(has order(e.g education))

1. **Numerical or quantitative**   
                   a)discrete(specific values e.g age)
                   b)continuous(interval e.g range)

After inspection of the data, we now want to get an overview of how the data looks like

### 3. **Indexing, selection and assigning**

Indexing in python is done in 2 ways.

1)By names

2)By index

#### **INDEXING BY NAMES**

- We use data.loc, the loc() function helps us to retrieve data values from a dataset at an ease. 
- Using the loc() function, we can access the data values fitted in the particular row or column based on the index value passed to the function.

- .loc indexing is exclusively ,meaning indexing from 0-10 will select 0-10 inclusively(none will be left out).

**SYNTAX:**

`pandas.DataFrame.loc[index label]`

The index label may be;Single label – example: String, List of string, Slice objects with labels, List of an array of labels, etc.

In [44]:
import pandas as pd
df2=pd.read_csv(("df.csv"), index_col=0)
#df2.set_index("County",inplace=True)
df2

          Population   Area      count
County
Nairobi    4397073.0    704  4397073.0
Kisumu     1155574.0   2085  1155574.0
Mombasa    1208333.0    220  1208333.0
Bungoma    1670570.0   3024  1670570.0
Mandera     867457.0  25942   867457.0
Turkana     926976.0  68233   926976.0
Marsabit    459785.0  70944   459785.0
Nyeri       759164.0   3325   759164.0
Nairobi    4397073.0    704  4397073.0
Embu             NaN   2821        NaN

**Extract One Row from a Data frame**

Set County as the index col `"index_col=County"` when importing or use
`df2.set_index("County", inplace=True)`

In [45]:
print(df2.loc['Nairobi'])  #Extracting row one (you need to make County the index)

         Population  Area      count
County
Nairobi   4397073.0   704  4397073.0
Nairobi   4397073.0   704  4397073.0

**Extract Multiple Rows from a Data frame**

In [46]:
print(df2.loc[["Bungoma","Embu", "Nyeri"]])

         Population  Area      count
County
Bungoma   1670570.0  3024  1670570.0
Embu            NaN  2821        NaN
Nyeri      759164.0  3325   759164.0

**Extract Range of Rows using Python loc()**

In [47]:
print(df2.loc["Bungoma":"Embu"])

          Population   Area      count
County
Bungoma    1670570.0   3024  1670570.0
Mandera     867457.0  25942   867457.0
Turkana     926976.0  68233   926976.0
Marsabit    459785.0  70944   459785.0
Nyeri       759164.0   3325   759164.0
Nairobi    4397073.0    704  4397073.0
Embu             NaN   2821        NaN

In [48]:
#row 1 column 1(Datum)
df2.loc["Nairobi","Population"] #gives two output since Nairobi is repeated

County
Nairobi    4397073.0
Nairobi    4397073.0
Name: Population, dtype: float64

In [49]:
#indexing a range of values in rows and columns
df2.loc["Turkana":"Embu",["Population","count"]]

          Population      count
County
Turkana     926976.0   926976.0
Marsabit    459785.0   459785.0
Nyeri       759164.0   759164.0
Nairobi    4397073.0  4397073.0
Embu             NaN        NaN

In [50]:
#extract an entire row
df2.loc[:,["Population"]]

          Population
County
Nairobi    4397073.0
Kisumu     1155574.0
Mombasa    1208333.0
Bungoma    1670570.0
Mandera     867457.0
Turkana     926976.0
Marsabit    459785.0
Nyeri       759164.0
Nairobi    4397073.0
Embu             NaN

####  using "get_loc" and "index" methods

In [51]:
df2.columns.get_loc("count")

2

In [52]:
start=df2.columns.get_loc("Population")
end=df2.columns.get_loc("count")
start,end

(0, 2)

In [53]:
df2.iloc[:, start:end]

          Population   Area
County
Nairobi    4397073.0    704
Kisumu     1155574.0   2085
Mombasa    1208333.0    220
Bungoma    1670570.0   3024
Mandera     867457.0  25942
Turkana     926976.0  68233
Marsabit    459785.0  70944
Nyeri       759164.0   3325
Nairobi    4397073.0    704
Embu             NaN   2821

In [54]:
start=df2.index[1]
end=df2.index[6]
start,end

('Kisumu', 'Marsabit')

In [55]:
df2.loc[start:end,["Population", "Area"]]

          Population   Area
County
Kisumu     1155574.0   2085
Mombasa    1208333.0    220
Bungoma    1670570.0   3024
Mandera     867457.0  25942
Turkana     926976.0  68233
Marsabit    459785.0  70944

#### **Indexing by index**

--We use data.iloc ,eloc uses standard python indexing i.e indexing from 0-10 will select from 0-9

In [56]:
#range of rows and columns
df2.iloc[2:7,0:3]

          Population   Area      count
County
Mombasa    1208333.0    220  1208333.0
Bungoma    1670570.0   3024  1670570.0
Mandera     867457.0  25942   867457.0
Turkana     926976.0  68233   926976.0
Marsabit    459785.0  70944   459785.0

In [57]:
df2.iloc[[2,5,7]]  #selecting rows with different index position

         Population   Area      count
County
Mombasa   1208333.0    220  1208333.0
Turkana    926976.0  68233   926976.0
Nyeri      759164.0   3325   759164.0

In [58]:
rows=[2,5,7]
df2.iloc[rows] #I pass a list of values to the .iloc indexer to reproduce the above DataFrame.

         Population   Area      count
County
Mombasa   1208333.0    220  1208333.0
Turkana    926976.0  68233   926976.0
Nyeri      759164.0   3325   759164.0

In [59]:
#a value
df2.iloc[1,1]

2085

In [60]:
df2.iloc[0,2]

4397073.0

In [61]:
df2.iloc[0:,[2]]

              count
County
Nairobi   4397073.0
Kisumu    1155574.0
Mombasa   1208333.0
Bungoma   1670570.0
Mandera    867457.0
Turkana    926976.0
Marsabit   459785.0
Nyeri      759164.0
Nairobi   4397073.0
Embu            NaN

#### **Different ways to select columns**

Selecting a single column

To select the first column 'Population', you can pass the column name as a string to the indexing operator.

In [62]:
df2["Population"]

County
Nairobi     4397073.0
Kisumu      1155574.0
Mombasa     1208333.0
Bungoma     1670570.0
Mandera      867457.0
Turkana      926976.0
Marsabit     459785.0
Nyeri        759164.0
Nairobi     4397073.0
Embu              NaN
Name: Population, dtype: float64

In [63]:
df2

          Population   Area      count
County
Nairobi    4397073.0    704  4397073.0
Kisumu     1155574.0   2085  1155574.0
Mombasa    1208333.0    220  1208333.0
Bungoma    1670570.0   3024  1670570.0
Mandera     867457.0  25942   867457.0
Turkana     926976.0  68233   926976.0
Marsabit    459785.0  70944   459785.0
Nyeri       759164.0   3325   759164.0
Nairobi    4397073.0    704  4397073.0
Embu             NaN   2821        NaN

**You can perform the same task using the dot operator.**

In [64]:
df2.Population

County
Nairobi     4397073.0
Kisumu      1155574.0
Mombasa     1208333.0
Bungoma     1670570.0
Mandera      867457.0
Turkana      926976.0
Marsabit     459785.0
Nyeri        759164.0
Nairobi     4397073.0
Embu              NaN
Name: Population, dtype: float64

#### **Selecting multiple columns**

To select multiple columns, you can pass a list of column names to the indexing operator.

In [65]:
df[["Area", "count"]]

    Area      count
0    704  4397073.0
1   2085  1155574.0
2    220  1208333.0
3   3024  1670570.0
4  25942   867457.0
5  68233   926976.0
6  70944   459785.0
7   3325   759164.0
8    704  4397073.0
9   2821        NaN

In [66]:
#selecting multiple columns
df2[["count","Population", "Area"]]

              count  Population   Area
County
Nairobi   4397073.0   4397073.0    704
Kisumu    1155574.0   1155574.0   2085
Mombasa   1208333.0   1208333.0    220
Bungoma   1670570.0   1670570.0   3024
Mandera    867457.0    867457.0  25942
Turkana    926976.0    926976.0  68233
Marsabit   459785.0    459785.0  70944
Nyeri      759164.0    759164.0   3325
Nairobi   4397073.0   4397073.0    704
Embu            NaN         NaN   2821

Alternatively, you can assign all your columns to a list variable and pass that variable to the indexing operator.

In [67]:
columns=["count","Population", "Area"]
selected_columns=df2[columns]
print(selected_columns)

              count  Population   Area
County
Nairobi   4397073.0   4397073.0    704
Kisumu    1155574.0   1155574.0   2085
Mombasa   1208333.0   1208333.0    220
Bungoma   1670570.0   1670570.0   3024
Mandera    867457.0    867457.0  25942
Turkana    926976.0    926976.0  68233
Marsabit   459785.0    459785.0  70944
Nyeri      759164.0    759164.0   3325
Nairobi   4397073.0   4397073.0    704
Embu            NaN         NaN   2821

#### **Selecting columns using "select_dtypes" and "filter" methods**

First, check the kind of data stored in each column

In [68]:
df2.dtypes.value_counts()

float64    2
int64      1
dtype: int64

Secting the columns with the float data

In [69]:
df.select_dtypes(include=["float"])

   Population      count
0   4397073.0  4397073.0
1   1155574.0  1155574.0
2   1208333.0  1208333.0
3   1670570.0  1670570.0
4    867457.0   867457.0
5    926976.0   926976.0
6    459785.0   459785.0
7    759164.0   759164.0
8   4397073.0  4397073.0
9         NaN        NaN

You can also use the filter method to select columns based on the column names or index labels

In [70]:
df.filter(like="pu")

   Population
0   4397073.0
1   1155574.0
2   1208333.0
3   1670570.0
4    867457.0
5    926976.0
6    459785.0
7    759164.0
8   4397073.0
9         NaN

In example above, the filter method returns columns that contain the exact string 'pu'. 
The like parameter takes a string as an input and returns columns that has the string.

### 4. **Methods to rename columns in Pandas**

#### **Method I : rename() function**

Suppose you want to replace column name population with Population_size and count to count_n0. In the code below it will create a new dataframe named df3 having new column names and same values.

In [71]:
df3=df2.rename(columns={"Population":"Population_size", "count":"count_no"})
df3

          Population_size   Area   count_no
County
Nairobi         4397073.0    704  4397073.0
Kisumu          1155574.0   2085  1155574.0
Mombasa         1208333.0    220  1208333.0
Bungoma         1670570.0   3024  1670570.0
Mandera          867457.0  25942   867457.0
Turkana          926976.0  68233   926976.0
Marsabit         459785.0  70944   459785.0
Nyeri            759164.0   3325   759164.0
Nairobi         4397073.0    704  4397073.0
Embu                  NaN   2821        NaN

If you print df2, the variables will still be named with the original names, to make the changes we include a
parameter `inplace=True`

In [72]:
df2.rename(columns={"Population":"Population_size", "count":"count_no"},inplace=True)
df2

          Population_size   Area   count_no
County
Nairobi         4397073.0    704  4397073.0
Kisumu          1155574.0   2085  1155574.0
Mombasa         1208333.0    220  1208333.0
Bungoma         1670570.0   3024  1670570.0
Mandera          867457.0  25942   867457.0
Turkana          926976.0  68233   926976.0
Marsabit         459785.0  70944   459785.0
Nyeri            759164.0   3325   759164.0
Nairobi         4397073.0    704  4397073.0
Embu                  NaN   2821        NaN

#### Method II : dataframe.columns = [list]

You can also assign the list of new column names to df.columns. See the example below. We are renaming Population and count columns here.

In [73]:
import pandas as pd
df2=pd.read_csv(("df.csv"))
#df2.set_index("County",inplace=True)
df2

     County  Population   Area      count
0   Nairobi   4397073.0    704  4397073.0
1    Kisumu   1155574.0   2085  1155574.0
2   Mombasa   1208333.0    220  1208333.0
3   Bungoma   1670570.0   3024  1670570.0
4   Mandera    867457.0  25942   867457.0
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0
9      Embu         NaN   2821        NaN

In [74]:
df2.columns

Index(['County', 'Population', 'Area', 'count'], dtype='object')

In [75]:
df2.columns=["county2","population","area","count"]
df2

    county2  population   area      count
0   Nairobi   4397073.0    704  4397073.0
1    Kisumu   1155574.0   2085  1155574.0
2   Mombasa   1208333.0    220  1208333.0
3   Bungoma   1670570.0   3024  1670570.0
4   Mandera    867457.0  25942   867457.0
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0
9      Embu         NaN   2821        NaN

#### Rename columns having pattern

**Changing the order of your columns**

Suppose you want to rename columns having underscore '_' in their names. You want to get rid of underscore

In [76]:
df2.columns = df2.columns.str.replace('_' , "")
df2

    county2  population   area      count
0   Nairobi   4397073.0    704  4397073.0
1    Kisumu   1155574.0   2085  1155574.0
2   Mombasa   1208333.0    220  1208333.0
3   Bungoma   1670570.0   3024  1670570.0
4   Mandera    867457.0  25942   867457.0
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0
9      Embu         NaN   2821        NaN

New column names are as follows. You can observe no underscore in the column names.

In [77]:
group1=["Area","count"]
group2=["Population","County"]
new_cols=group1+group2
set(df.columns)==set(new_cols)
dft_2=df[new_cols]
print(dft_2)

    Area      count  Population    County
0    704  4397073.0   4397073.0   Nairobi
1   2085  1155574.0   1155574.0    Kisumu
2    220  1208333.0   1208333.0   Mombasa
3   3024  1670570.0   1670570.0   Bungoma
4  25942   867457.0    867457.0   Mandera
5  68233   926976.0    926976.0   Turkana
6  70944   459785.0    459785.0  Marsabit
7   3325   759164.0    759164.0     Nyeri
8    704  4397073.0   4397073.0   Nairobi
9   2821        NaN         NaN      Embu

### **5. How to get summary statistics of your data**

In [78]:
df2["population"].mean()

1760222.7777777778

In [79]:
df2["population"].mode()

0    4397073.0
Name: population, dtype: float64

In [80]:
df2["population"].median()

1155574.0

In [81]:
#max value
df2["population"].max()

4397073.0

In [82]:
#minimum value
df2["population"].min()

459785.0

In [83]:
#gives position of most maximum number
df2["population"].argmax()

0

In [84]:
#gives position of most minimum number
df2["population"].argmin()

6

In [85]:
#summary stats of  population
df2["population"].describe()

count    9.000000e+00
mean     1.760223e+06
std      1.531697e+06
min      4.597850e+05
25%      8.674570e+05
50%      1.155574e+06
75%      1.670570e+06
max      4.397073e+06
Name: population, dtype: float64

In [86]:
#gives summary statistics
df2.describe()

         population          area         count
count  9.000000e+00     10.000000  9.000000e+00
mean   1.760223e+06  17800.200000  1.760223e+06
std    1.531697e+06  28336.969742  1.531697e+06
min    4.597850e+05    220.000000  4.597850e+05
25%    8.674570e+05   1049.250000  8.674570e+05
50%    1.155574e+06   2922.500000  1.155574e+06
75%    1.670570e+06  20287.750000  1.670570e+06
max    4.397073e+06  70944.000000  4.397073e+06

In [87]:
#gives standard deviation
df2["population"].std()

1531697.0285356513

- To get summary stats of categorical data we include a parameter "O"(uppercase O).

In [88]:
#summary stats of categorical data
df2.describe(include ="O")

        county2
count        10
unique        9
top     Nairobi
freq          2

In [89]:
df2

    county2  population   area      count
0   Nairobi   4397073.0    704  4397073.0
1    Kisumu   1155574.0   2085  1155574.0
2   Mombasa   1208333.0    220  1208333.0
3   Bungoma   1670570.0   3024  1670570.0
4   Mandera    867457.0  25942   867457.0
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0
9      Embu         NaN   2821        NaN

In [90]:
df2["county2"].dtype

dtype('O')

In [91]:
#to check unique/specific levels in a column

df2["county2"].unique()

array(['Nairobi', 'Kisumu', 'Mombasa', 'Bungoma', 'Mandera', 'Turkana',
       'Marsabit', 'Nyeri', 'Embu'], dtype=object)

In [92]:
#count of unique levels
df2["county2"].nunique()

9

In [93]:
len(df2["county2"].unique())

9

### **6. CHECKING FOR MISSING VALUES IN OUR DATA**

- we use 
     - data.isnull() or
     - data.isna().

- It returns a data frame filled with bools,depending on whether the missing values are present in the data or not.

In [94]:
df2.isna()

   county2  population   area  count
0    False       False  False  False
1    False       False  False  False
2    False       False  False  False
3    False       False  False  False
4    False       False  False  False
5    False       False  False  False
6    False       False  False  False
7    False       False  False  False
8    False       False  False  False
9    False        True  False   True

 We need to check at some functions to summarise the missing values statistics when dealing with large dataset

- data.isnull().all()--Returns true if all values in a column are null else returns false

- data.isnull().sum()--gives sum of missing values in each column

- data.isnull().any()--checks if there exists any null values in individual columns and returns true if they exist and false if they dont

In [95]:
df2.isnull().any()

county2       False
population     True
area          False
count          True
dtype: bool

In [96]:
df2.isna().all()

county2       False
population    False
area          False
count         False
dtype: bool

In [97]:
df2.isna().sum()

county2       0
population    1
area          0
count         1
dtype: int64

### **DEALING WITH MISSING VALUES**

- By  default inplace = false.

- inplace = true it means that the changes will be done to the original data

- By default i.e inplace = false you have to assign it to something a new variable or the same variable just to hold the changes.

- If inplace=true the data is modified in place and the original data is updated.

- The **include** parameter is commonly used in the following methods:

a. **dropna()**

b. **drop_duplicates()**

c. **fillna()**

**a)Dropna**

In [98]:
#drops by default all rows with na
df2.dropna()
#by default axis='rows'

    county2  population   area      count
0   Nairobi   4397073.0    704  4397073.0
1    Kisumu   1155574.0   2085  1155574.0
2   Mombasa   1208333.0    220  1208333.0
3   Bungoma   1670570.0   3024  1670570.0
4   Mandera    867457.0  25942   867457.0
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0

In [99]:
#drops all columns with na values
#df2.dropna(axis="columns")
#or axis = 1

- the best way to deal with nas is to fill them with values

- we use the function fillna

In [100]:
#fills na values in population column with mean
x=df2["population"].mean()
df2["population"].fillna(x,inplace= True)
print(df2)

    county2    population   area      count
0   Nairobi  4.397073e+06    704  4397073.0
1    Kisumu  1.155574e+06   2085  1155574.0
2   Mombasa  1.208333e+06    220  1208333.0
3   Bungoma  1.670570e+06   3024  1670570.0
4   Mandera  8.674570e+05  25942   867457.0
5   Turkana  9.269760e+05  68233   926976.0
6  Marsabit  4.597850e+05  70944   459785.0
7     Nyeri  7.591640e+05   3325   759164.0
8   Nairobi  4.397073e+06    704  4397073.0
9      Embu  1.760223e+06   2821        NaN

### **Check how the following functions work**

#### import

In [101]:
import pandas as pd
df2=pd.read_csv(("df.csv"))
df2

     County  Population   Area      count
0   Nairobi   4397073.0    704  4397073.0
1    Kisumu   1155574.0   2085  1155574.0
2   Mombasa   1208333.0    220  1208333.0
3   Bungoma   1670570.0   3024  1670570.0
4   Mandera    867457.0  25942   867457.0
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0
9      Embu         NaN   2821        NaN

#### **e)rename()**

 It renames any index,column or row.

In [102]:
#example
df2.rename(index={0:"a",1:"b"},inplace =True)
df2.rename(columns={"County":"a","Population":"b","Area":"c","count":"d"},inplace=True)

#### **d. query()**

- used to query the columns of a dataframe with a boolean expression.

In [103]:
df2.query('c > 700' and 'b > 759164')

         a          b      c          d
a  Nairobi  4397073.0    704  4397073.0
b   Kisumu  1155574.0   2085  1155574.0
2  Mombasa  1208333.0    220  1208333.0
3  Bungoma  1670570.0   3024  1670570.0
4  Mandera   867457.0  25942   867457.0
5  Turkana   926976.0  68233   926976.0
8  Nairobi  4397073.0    704  4397073.0

In [104]:
df2

          a          b      c          d
a   Nairobi  4397073.0    704  4397073.0
b    Kisumu  1155574.0   2085  1155574.0
2   Mombasa  1208333.0    220  1208333.0
3   Bungoma  1670570.0   3024  1670570.0
4   Mandera   867457.0  25942   867457.0
5   Turkana   926976.0  68233   926976.0
6  Marsabit   459785.0  70944   459785.0
7     Nyeri   759164.0   3325   759164.0
8   Nairobi  4397073.0    704  4397073.0
9      Embu        NaN   2821        NaN

#### **f)reset_index()**

resets the index of  a data frame and uses the default one instead

In [105]:
#makes the existing index as a column and uses default indexing
df2.reset_index(drop=True)

          a          b      c          d
0   Nairobi  4397073.0    704  4397073.0
1    Kisumu  1155574.0   2085  1155574.0
2   Mombasa  1208333.0    220  1208333.0
3   Bungoma  1670570.0   3024  1670570.0
4   Mandera   867457.0  25942   867457.0
5   Turkana   926976.0  68233   926976.0
6  Marsabit   459785.0  70944   459785.0
7     Nyeri   759164.0   3325   759164.0
8   Nairobi  4397073.0    704  4397073.0
9      Embu        NaN   2821        NaN

In [106]:
#drops the existing index and uses the default one
df2=df2.reset_index(drop = True)
df2

          a          b      c          d
0   Nairobi  4397073.0    704  4397073.0
1    Kisumu  1155574.0   2085  1155574.0
2   Mombasa  1208333.0    220  1208333.0
3   Bungoma  1670570.0   3024  1670570.0
4   Mandera   867457.0  25942   867457.0
5   Turkana   926976.0  68233   926976.0
6  Marsabit   459785.0  70944   459785.0
7     Nyeri   759164.0   3325   759164.0
8   Nairobi  4397073.0    704  4397073.0
9      Embu        NaN   2821        NaN

#### **g)sort_index()**

--returns a new data frame sorted by label if inplace argument is false.

--otherwise updates the original dataframe and returns none

In [107]:
df2.sort_index()

          a          b      c          d
0   Nairobi  4397073.0    704  4397073.0
1    Kisumu  1155574.0   2085  1155574.0
2   Mombasa  1208333.0    220  1208333.0
3   Bungoma  1670570.0   3024  1670570.0
4   Mandera   867457.0  25942   867457.0
5   Turkana   926976.0  68233   926976.0
6  Marsabit   459785.0  70944   459785.0
7     Nyeri   759164.0   3325   759164.0
8   Nairobi  4397073.0    704  4397073.0
9      Embu        NaN   2821        NaN

In [108]:
df2

          a          b      c          d
0   Nairobi  4397073.0    704  4397073.0
1    Kisumu  1155574.0   2085  1155574.0
2   Mombasa  1208333.0    220  1208333.0
3   Bungoma  1670570.0   3024  1670570.0
4   Mandera   867457.0  25942   867457.0
5   Turkana   926976.0  68233   926976.0
6  Marsabit   459785.0  70944   459785.0
7     Nyeri   759164.0   3325   759164.0
8   Nairobi  4397073.0    704  4397073.0
9      Embu        NaN   2821        NaN

In [109]:
df2.sort_index(ascending = False)

          a          b      c          d
9      Embu        NaN   2821        NaN
8   Nairobi  4397073.0    704  4397073.0
7     Nyeri   759164.0   3325   759164.0
6  Marsabit   459785.0  70944   459785.0
5   Turkana   926976.0  68233   926976.0
4   Mandera   867457.0  25942   867457.0
3   Bungoma  1670570.0   3024  1670570.0
2   Mombasa  1208333.0    220  1208333.0
1    Kisumu  1155574.0   2085  1155574.0
0   Nairobi  4397073.0    704  4397073.0

#### **h)sort_value()**

--sort by the values along either axis

In [110]:
df2.sort_values(by=["a"])

          a          b      c          d
3   Bungoma  1670570.0   3024  1670570.0
9      Embu        NaN   2821        NaN
1    Kisumu  1155574.0   2085  1155574.0
4   Mandera   867457.0  25942   867457.0
6  Marsabit   459785.0  70944   459785.0
2   Mombasa  1208333.0    220  1208333.0
0   Nairobi  4397073.0    704  4397073.0
8   Nairobi  4397073.0    704  4397073.0
7     Nyeri   759164.0   3325   759164.0
5   Turkana   926976.0  68233   926976.0

In [111]:
df2.drop('a',axis=1,inplace=True)

In [112]:
#fills all nas in the data with the given value
df2.fillna(1463451,inplace = True)

In [113]:
df2

           b      c          d
0  4397073.0    704  4397073.0
1  1155574.0   2085  1155574.0
2  1208333.0    220  1208333.0
3  1670570.0   3024  1670570.0
4   867457.0  25942   867457.0
5   926976.0  68233   926976.0
6   459785.0  70944   459785.0
7   759164.0   3325   759164.0
8  4397073.0    704  4397073.0
9  1463451.0   2821  1463451.0

In [114]:
df2.query('c==704')

           b    c          d
0  4397073.0  704  4397073.0
8  4397073.0  704  4397073.0

In [115]:
#add new column
df2['e']=5

In [116]:
#a column with specific values
df2['e']=[1,2,3,4,5,6,7,8,9,10]

In [117]:
df2.dropna()
df2['density']=df2['b'] / df2['c']

In [118]:
df2

           b      c          d   e      density
0  4397073.0    704  4397073.0   1  6245.842330
1  1155574.0   2085  1155574.0   2   554.232134
2  1208333.0    220  1208333.0   3  5492.422727
3  1670570.0   3024  1670570.0   4   552.437169
4   867457.0  25942   867457.0   5    33.438324
5   926976.0  68233   926976.0   6    13.585450
6   459785.0  70944   459785.0   7     6.480957
7   759164.0   3325   759164.0   8   228.320000
8  4397073.0    704  4397073.0   9  6245.842330
9  1463451.0   2821  1463451.0  10   518.770294

In [119]:
df2

           b      c          d   e      density
0  4397073.0    704  4397073.0   1  6245.842330
1  1155574.0   2085  1155574.0   2   554.232134
2  1208333.0    220  1208333.0   3  5492.422727
3  1670570.0   3024  1670570.0   4   552.437169
4   867457.0  25942   867457.0   5    33.438324
5   926976.0  68233   926976.0   6    13.585450
6   459785.0  70944   459785.0   7     6.480957
7   759164.0   3325   759164.0   8   228.320000
8  4397073.0    704  4397073.0   9  6245.842330
9  1463451.0   2821  1463451.0  10   518.770294

In [120]:
df2

           b      c          d   e      density
0  4397073.0    704  4397073.0   1  6245.842330
1  1155574.0   2085  1155574.0   2   554.232134
2  1208333.0    220  1208333.0   3  5492.422727
3  1670570.0   3024  1670570.0   4   552.437169
4   867457.0  25942   867457.0   5    33.438324
5   926976.0  68233   926976.0   6    13.585450
6   459785.0  70944   459785.0   7     6.480957
7   759164.0   3325   759164.0   8   228.320000
8  4397073.0    704  4397073.0   9  6245.842330
9  1463451.0   2821  1463451.0  10   518.770294

#### **dropping columns**

--we use

df2.drop('a',axis=1,inplace = True)

In [121]:
del(df2['b'])

In [122]:
df2

       c          d   e      density
0    704  4397073.0   1  6245.842330
1   2085  1155574.0   2   554.232134
2    220  1208333.0   3  5492.422727
3   3024  1670570.0   4   552.437169
4  25942   867457.0   5    33.438324
5  68233   926976.0   6    13.585450
6  70944   459785.0   7     6.480957
7   3325   759164.0   8   228.320000
8    704  4397073.0   9  6245.842330
9   2821  1463451.0  10   518.770294

### **Boolean indexing**

--Uses single column values to select data.

In [123]:
import pandas as pd
df2=pd.read_csv(("df.csv"))
df2

     County  Population   Area      count
0   Nairobi   4397073.0    704  4397073.0
1    Kisumu   1155574.0   2085  1155574.0
2   Mombasa   1208333.0    220  1208333.0
3   Bungoma   1670570.0   3024  1670570.0
4   Mandera    867457.0  25942   867457.0
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0
9      Embu         NaN   2821        NaN

In [124]:
df2[df2.Population>759164]

    County  Population   Area      count
0  Nairobi   4397073.0    704  4397073.0
1   Kisumu   1155574.0   2085  1155574.0
2  Mombasa   1208333.0    220  1208333.0
3  Bungoma   1670570.0   3024  1670570.0
4  Mandera    867457.0  25942   867457.0
5  Turkana    926976.0  68233   926976.0
8  Nairobi   4397073.0    704  4397073.0

In [125]:
df2.isnull().sum()

County        0
Population    1
Area          0
count         1
dtype: int64

In [126]:
df2.dropna(inplace = True)

In [127]:
df2[df2["count"]>867457]

    County  Population   Area      count
0  Nairobi   4397073.0    704  4397073.0
1   Kisumu   1155574.0   2085  1155574.0
2  Mombasa   1208333.0    220  1208333.0
3  Bungoma   1670570.0   3024  1670570.0
5  Turkana    926976.0  68233   926976.0
8  Nairobi   4397073.0    704  4397073.0

### Other

In [128]:
df2

     County  Population   Area      count
0   Nairobi   4397073.0    704  4397073.0
1    Kisumu   1155574.0   2085  1155574.0
2   Mombasa   1208333.0    220  1208333.0
3   Bungoma   1670570.0   3024  1670570.0
4   Mandera    867457.0  25942   867457.0
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0

In [16]:
ph=pd.read_excel("census population households.xlsx", thousands=',')
ph

      County Sub County  Population  Households  Average Household Size
0    Mombasa  Changamwe    130541.0     46614.0                     2.8
1    Mombasa      Jomvu    162760.0     53472.0                     3.0
2    Mombasa    Kisauni    287131.0     88202.0                     3.3
3    Mombasa     Likoni    249230.0     81191.0                     3.1
4    Mombasa      Mvita    147983.0     38995.0                     3.8
..       ...        ...         ...         ...                     ...
343  Nairobi   Makadara    188792.0     70361.0                     2.7
344  Nairobi    Mathare    204469.0     74967.0                     2.7
345  Nairobi      Njiru    623471.0    204563.0                     3.0
346  Nairobi    Starehe    194726.0     69389.0                     2.8
347  Nairobi  Westlands    301295.0    104980.0                     2.9

[348 rows x 5 columns]

In [130]:
df2=pd.read_csv("df.csv")
df2

     County  Population   Area      count
0   Nairobi   4397073.0    704  4397073.0
1    Kisumu   1155574.0   2085  1155574.0
2   Mombasa   1208333.0    220  1208333.0
3   Bungoma   1670570.0   3024  1670570.0
4   Mandera    867457.0  25942   867457.0
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0
9      Embu         NaN   2821        NaN

In [131]:
#this is not a copy
df=df2
df

     County  Population   Area      count
0   Nairobi   4397073.0    704  4397073.0
1    Kisumu   1155574.0   2085  1155574.0
2   Mombasa   1208333.0    220  1208333.0
3   Bungoma   1670570.0   3024  1670570.0
4   Mandera    867457.0  25942   867457.0
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0
9      Embu         NaN   2821        NaN

In [132]:
df.drop('count',axis=1,inplace=True)

In [133]:
df2

     County  Population   Area
0   Nairobi   4397073.0    704
1    Kisumu   1155574.0   2085
2   Mombasa   1208333.0    220
3   Bungoma   1670570.0   3024
4   Mandera    867457.0  25942
5   Turkana    926976.0  68233
6  Marsabit    459785.0  70944
7     Nyeri    759164.0   3325
8   Nairobi   4397073.0    704
9      Embu         NaN   2821

In [134]:
#this is a copy any changes made on df are not reflected on df2 and vice versa
df=df2.copy()

In [135]:
#df.drop('count',axis=1,inplace=True)

In [136]:
df2

     County  Population   Area
0   Nairobi   4397073.0    704
1    Kisumu   1155574.0   2085
2   Mombasa   1208333.0    220
3   Bungoma   1670570.0   3024
4   Mandera    867457.0  25942
5   Turkana    926976.0  68233
6  Marsabit    459785.0  70944
7     Nyeri    759164.0   3325
8   Nairobi   4397073.0    704
9      Embu         NaN   2821

### **7. Merging datasets**

-- when merging datasets it is important to merge the datasets on the column that exist in both data sets and it has unique values.

--this helps in avoiding to redo the cleaning again in a merged dataset

--we use the following syntax to merge

pd.merge[data1,data2,on="column name"]

In [137]:
df2=pd.read_csv("df.csv")
df=df2.copy()
pd.merge(df2,df,on="count")

    County_x  Population_x  Area_x      count  County_y  Population_y  Area_y
0    Nairobi     4397073.0     704  4397073.0   Nairobi     4397073.0     704
1    Nairobi     4397073.0     704  4397073.0   Nairobi     4397073.0     704
2    Nairobi     4397073.0     704  4397073.0   Nairobi     4397073.0     704
3    Nairobi     4397073.0     704  4397073.0   Nairobi     4397073.0     704
4     Kisumu     1155574.0    2085  1155574.0    Kisumu     1155574.0    2085
5    Mombasa     1208333.0     220  1208333.0   Mombasa     1208333.0     220
6    Bungoma     1670570.0    3024  1670570.0   Bungoma     1670570.0    3024
7    Mandera      867457.0   25942   867457.0   Mandera      867457.0   25942
8    Turkana      926976.0   68233   926976.0   Turkana      926976.0   68233
9   Marsabit      459785.0   70944   459785.0  Marsabit      459785.0   70944
10     Nyeri      759164.0    3325   759164.0     Nyeri      759164.0    3325
11      Embu           NaN    2821        NaN      Embu           NaN    2821

--We can change datatypes from float to integer data types

--step1--extract the column

In [138]:
import numpy as np
df2.dropna(inplace=True)
df2

     County  Population   Area      count
0   Nairobi   4397073.0    704  4397073.0
1    Kisumu   1155574.0   2085  1155574.0
2   Mombasa   1208333.0    220  1208333.0
3   Bungoma   1670570.0   3024  1670570.0
4   Mandera    867457.0  25942   867457.0
5   Turkana    926976.0  68233   926976.0
6  Marsabit    459785.0  70944   459785.0
7     Nyeri    759164.0   3325   759164.0
8   Nairobi   4397073.0    704  4397073.0

In [139]:
df2["Population"]=df2["Population"].astype(np.int32)

In [140]:
df2

     County  Population   Area      count
0   Nairobi     4397073    704  4397073.0
1    Kisumu     1155574   2085  1155574.0
2   Mombasa     1208333    220  1208333.0
3   Bungoma     1670570   3024  1670570.0
4   Mandera      867457  25942   867457.0
5   Turkana      926976  68233   926976.0
6  Marsabit      459785  70944   459785.0
7     Nyeri      759164   3325   759164.0
8   Nairobi     4397073    704  4397073.0

In [141]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   County      9 non-null      object
 1   Population  9 non-null      int32
 2   Area        9 non-null      int64
 3   count       9 non-null      float64
dtypes: float64(1), int32(1), int64(1), object(1)
memory usage: 324.0+ bytes

Good book to read: https://jakevdp.github.io/PythonDataScienceHandbook/

- append() and concatenate()  https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html

- Combining Datasets: Merge and Join https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html

### **8. Group_by**

--groups rows that have the same value into summary rows and is used together with aggregating   functions for example sum()
mean()e.t.c

the name syntax is

DataFrame.groupby("column name")

In [2]:
import pandas as pd

In [13]:
cad=pd.read_excel("census area density.xlsx", thousands=',')
cad

    Sub County   Area  Density
0    Changamwe   17.7     7457
1        Jomvu   36.9     4432
2      Kisauni   87.7     3328
3       Likoni   40.5     6187
4        Mvita   14.6    10543
..         ...    ...      ...
343   Makadara   11.7    16150
344    Mathare    3.0    68941
345      Njiru  129.9     4821
346    Starehe   20.6    10205
347  Westlands   97.5     3167

[348 rows x 3 columns]

In [14]:
cad.dtypes

Sub County     object
Area          float64
Density         int64
dtype: object

In [17]:
ph

      County Sub County  Population  Households  Average Household Size
0    Mombasa  Changamwe    130541.0     46614.0                     2.8
1    Mombasa      Jomvu    162760.0     53472.0                     3.0
2    Mombasa    Kisauni    287131.0     88202.0                     3.3
3    Mombasa     Likoni    249230.0     81191.0                     3.1
4    Mombasa      Mvita    147983.0     38995.0                     3.8
..       ...        ...         ...         ...                     ...
343  Nairobi   Makadara    188792.0     70361.0                     2.7
344  Nairobi    Mathare    204469.0     74967.0                     2.7
345  Nairobi      Njiru    623471.0    204563.0                     3.0
346  Nairobi    Starehe    194726.0     69389.0                     2.8
347  Nairobi  Westlands    301295.0    104980.0                     2.9

[348 rows x 5 columns]

In [18]:
ph.dtypes

County                     object
Sub County                 object
Population                float64
Households                float64
Average Household Size    float64
dtype: object

In [19]:
ph.groupby("County").sum().reset_index()

             County  Population  Households  Average Household Size
0           Baringo    662760.0    142518.0                    33.8
1             Bomet    873023.0    187641.0                    23.3
2           Bungoma   1663898.0    358796.0                    56.6
3             Busia    886856.0    198152.0                    31.5
4   Elgeyo/Marakwet    453403.0     99861.0                    18.1
5              Embu    604769.0    182743.0                    17.9
6           Garissa    835482.0    141394.0                    43.6
7          Homa Bay   1125823.0    262036.0                    34.3
8            Isiolo    267997.0     58072.0                    14.3
9           Kajiado   1107296.0    316179.0                    22.4
10         Kakamega   1861332.0    433207.0                    56.3
11          Kericho    896863.0    206036.0                    26.4
12           Kiambu   2402834.0    795241.0                    40.5
13           Kilifi   1440958.0    298472.0                    46.9
14        Kirinyaga    605630.0    204188.0                    16.4
15            Kisii   1260509.0    308054.0                    45.7
16           Kisumu   1144777.0    300745.0                    27.2
17            Kitui   1130134.0    262942.0                    78.2
18            Kwale    858748.0    173176.0                    25.5
19         Laikipia    513879.0    149271.0                    18.0
20             Lamu    141909.0     37963.0                     8.0
21         Machakos   1414022.0    402466.0                    33.0
22          Makueni    977015.0    244669.0                    36.0
23          Mandera    862079.0    125763.0                    48.9
24         Marsabit    447150.0     77495.0                    40.6
25             Meru   1535635.0    426360.0                    43.2
26           Migori   1108950.0    240168.0                    37.2
27          Mombasa   1190987.0    378422.0                    19.1
28         Murang’a   1053059.0    318105.0                    27.7
29          Nairobi   4337080.0   1506888.0                    31.6
30           Nakuru   2142667.0    616046.0                    39.9
31            Nandi    883634.0    199426.0                    26.8
32            Narok   1149379.0    241125.0                    30.1
33          Nyamira    603051.0    150669.0                    19.8
34        Nyandarua    636002.0    179686.0                    26.2
35            Nyeri    752695.0    248050.0                    27.8
36          Samburu    307957.0     65910.0                    14.0
37            Siaya    989708.0    250698.0                    23.7
38     Taita/Taveta    335747.0     96429.0                    14.1
39       Tana River    314710.0     68242.0                    13.8
40    Tharaka-Nithi    391303.0    109860.0                    20.0
41      Trans Nzoia    985333.0    223808.0                    22.2
42          Turkana    922210.0    164519.0                    40.8
43      Uasin Gishu   1152671.0    304943.0                    23.0
44           Vihiga    587189.0    143365.0                    21.8
45            Wajir    775302.0    127932.0                    50.0
46       West Pokot    618867.0    116182.0                    27.0

In [20]:
ph.groupby("County").sum().reset_index().max()

County                    West Pokot
Population                 4337080.0
Households                 1506888.0
Average Household Size          78.2
dtype: object

In [21]:
ph.dropna(inplace=True)

In [22]:
ph

      County Sub County  Population  Households  Average Household Size
0    Mombasa  Changamwe    130541.0     46614.0                     2.8
1    Mombasa      Jomvu    162760.0     53472.0                     3.0
2    Mombasa    Kisauni    287131.0     88202.0                     3.3
3    Mombasa     Likoni    249230.0     81191.0                     3.1
4    Mombasa      Mvita    147983.0     38995.0                     3.8
..       ...        ...         ...         ...                     ...
343  Nairobi   Makadara    188792.0     70361.0                     2.7
344  Nairobi    Mathare    204469.0     74967.0                     2.7
345  Nairobi      Njiru    623471.0    204563.0                     3.0
346  Nairobi    Starehe    194726.0     69389.0                     2.8
347  Nairobi  Westlands    301295.0    104980.0                     2.9

[345 rows x 5 columns]

In [148]:
ph.groupby("Sub County")

In [149]:
ph

      County Sub County Population Households  Average Household Size
0    Mombasa  Changamwe    130,541     46,614                     2.8
1    Mombasa      Jomvu    162,760     53,472                     3.0
2    Mombasa    Kisauni    287,131     88,202                     3.3
3    Mombasa     Likoni    249,230     81,191                     3.1
4    Mombasa      Mvita    147,983     38,995                     3.8
..       ...        ...        ...        ...                     ...
343  Nairobi   Makadara    188,792     70,361                     2.7
344  Nairobi    Mathare    204,469     74,967                     2.7
345  Nairobi      Njiru    623,471    204,563                     3.0
346  Nairobi    Starehe    194,726     69,389                     2.8
347  Nairobi  Westlands    301,295    104,980                     2.9

[345 rows x 5 columns]

# Assignment
**using the two datasets combine them togethre using append,concatenate,merge**

1). why the data is not recognising the comma seperated value 130,456

3). group the two data using county and subcounty and fine the mean in each 

4). create a third categorical  column variable called overpopulated to check density,,if density is greater than 3000 it should assign yes if not it should assign yes

5). group using the three variables and find mean population in those areas

2). change the data types of population ,households from object to integers /float.

In [150]:
ph.dropna(inplace=True)

In [151]:
ph.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 345 entries, 0 to 347
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   County                  345 non-null    object
 1   Sub County              345 non-null    object
 2   Population              345 non-null    object
 3   Households              345 non-null    object
 4   Average Household Size  345 non-null    float64
dtypes: float64(1), object(4)
memory usage: 16.2+ KB

In [152]:
ph["Population"]=ph["Population"].astype(np.int64)

ValueError: invalid literal for int() with base 10: '130,541'

In [ ]:
ph["Average Household Size"]=ph["Average Household Size"].astype(np.int64)

In [ ]:
ph.info()

In [ ]:
#merging ph and df2 using the append function
new=ph.append(cad)
new